[
    {
      "id": 1,
      "title": "Gestion de stock",
      "description": "Une application conçue pour gérer efficacement le stock de matières premières (farine, eau, etc.) et de produits finis (différents types de pâtes). Elle offre une interface utilisateur intuitive pour suivre en temps réel les entrées, les sorties et les niveaux de stock. L'application intègre également des fonctionnalités pour la planification de production, la traçabilité des produits et la gestion des commandes.",
      "image": "/assets/images/projets/elmedine.png",
      "context": "Ce projet a été réalisé pour aider une usine de production de pâtes à automatiser la gestion de son stock, réduire le gaspillage et améliorer la traçabilité des produits finis. L'objectif principal est d'assurer un flux continu entre la production et la distribution, tout en optimisant les ressources.",
      "technologies": ["HTML", "CSS", "JavaScript", "Angular", "Flask", "Django REST"],
      "etat": "En cours",
      "codeLink": "https://github.com/TalebMaham/medine",
      "productionLink": "https://chri2.com/medine"
    },
    {
      "id": 2,
      "title": "Monnayeur",
      "description": "Le projet de monnayeur pour E-thik vise à moderniser et optimiser le système de paiement des machines de distribution automatisées. Ce monnayeur intelligent, conçu pour gérer les transactions en espèces de manière fiable et sécurisée, est adapté à une large gamme de produits et de prix. Son architecture modulaire permet une intégration facile aux machines existantes et garantit la compatibilité avec les pièces, les billets, et potentiellement les paiements numériques comme les cartes NFC. Doté de capteurs de haute précision, il vérifie la validité des paiements, évitant les fraudes, et rejette automatiquement les anomalies pour assurer l’intégrité des transactions.",
      "image": "/assets/images/projets/cashier.png",
      "context": "E-thik, une société spécialisée dans la distribution automatique de produits, cherchait à améliorer l’expérience utilisateur et à réduire les coûts d’entretien de ses machines de distribution. Le défi principal résidait dans la création d’un système robuste, précis et facile à maintenir, capable de répondre aux attentes des clients tout en évitant les fraudes potentielles. Ce projet s’inscrit dans une démarche d’innovation visant à renforcer la fiabilité des transactions tout en préparant l’intégration de technologies de paiement avancées.",
      "technologies": ["React", "Flask", "Django REST"],
      "etat": "Terminé"
    },
    {
      "id": 3,
      "title": "Casier D2C",
      "description": "Le projet des casiers D2C a été conçu pour E-thik afin d’offrir une solution innovante de stockage et de livraison directe aux consommateurs. Ces casiers automatisés optimisent la gestion logistique en facilitant l’accès aux produits et en structurant le planogramme et le suivi des stocks.",
      "image": "/assets/images/projets/casier_d2c.png",
      "context": "Face au retard de livraison des casiers physiques, un simulateur a été développé pour reproduire leur fonctionnement, tester la gestion des produits et organiser le planogramme, assurant ainsi une gestion efficace de l’espace.",
      "technologies": ["React", "Python", "Django", "PostgreSQL"],
      "etat": "Prototype"
    }
  ]
  